app/controllers/gists_controller.rb

  def index
    @gists = Gist.paginate(page: params[:page], per_page: 5).order('created_at DESC')
---
SELECT "gists".* FROM "gists" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "gists"

  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save
---
INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 26 Mar 2014 18:20:19 UTC +00:00], ["description", "desc"], ["lang", "c"], ["snippet", "snip"], ["updated_at", Wed, 26 Mar 2014 18:20:19 UTC +00:00]]

  def update
    respond_to do |format|
      if @gist.update(gist_params)
---
UPDATE "gists" SET "snippet" = ?, "lang" = ?, "updated_at" = ? WHERE "gists"."id" = 5  [["snippet", "#dfsddffd {\r\n\r\n}"], ["lang", "css"], ["updated_at", Thu, 27 Mar 2014 18:14:33 UTC +00:00]]

    def set_gist
      @gist = Gist.find(params[:id])
---
SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "5"]]